import json
from pathlib import Path
from django.shortcuts import render
from parser_app.models import MainSpec
from modules.bs4phone_data import dict_specs
from modules.play_wright_task import main
from modules.phone_data_selenium import phone_characteristics


print(type(dict_specs))


# Create your views here.
def index_page(request):
    ''' Виводить вітальну інформацію на проекті '''
    all_specs = MainSpec.objects.all()
    # print("--- Специфікація телефону включає --- : ",all_specs)
    return render(request, 'index.html',{"data":all_specs})

def specs_bs4(request, **kwargs):  # value = None):
    ''' Dumps the parsed characteristics into PostGRE database '''


    # dict_specs = {'Форм-фактор': 'моноблок', 'Кількість SIM-карт': '1 SIM + e-sim', 'Формат SIM-карти': 'e-sim , Nano', "Покоління зв'язку (2G /3G/4G/5G)": '2G , 3G , 4G , 5G', 'Тип дисплея': 'OLED', 'Діагональ екрану': '6.1"', 'Роздільна здатність екрану': '1179 х 2556', 'Частота оновлення екрану': '60 Гц',
    #         'Процесор': 'Apple A16 Bionic', 'Кількість ядер': '6 core', "Вбудована пам'ять": '128 Gb', 'Кількість модулів основної камери': '2', 'Основна камера': '48 + 12 Mpx', 'Діафрагма основної камери': 'f/1.6 + f/2.4', 'Метод стабілізації': 'оптична', 'Запис відео основної камери': '4K / 3840x2160 / стереозвук',
    #         'Кількість модулів фронтальної камери': '1', 'Фронтальна камера': '12 Mpx', 'Діафрагма фронтальної камери': 'f/1.9', 'Функції камери': 'панорама , розпізнавання обличчя , геотегінг , спалах , автофокус', 'Операційна система': 'iOS 17', 'Мультимедіа': 'FM-радіо , мобільні сервіси Google , соціальні мережі , відеоплеєр , музичний плеєр , ігри',
    #         'Органайзер': 'калькулятор , телефонна книга , диктофон , секундомір , нотатки , будильник , світовий час , годинник , календар', 'Бездротові підключення': 'Bluetooth , WI-FI , NFC', 'Навігація': 'BeiDou , Galileo , QZSS , iBeacon , GPS , A-GPS', 'Інтерфейси і підключення': 'USB Type-C', 'Особливості': 'IP68 certified',
    #         'Вбудовані датчики': 'датчик освітлення , компас , акселерометр , датчик наближення , гіроскоп , барометр', 'Безпека': 'FaceID', 'Оснащення': 'пило/вологозахист , гіроскоп , бездротове заряджання', 'Розміри (мм)': '147.6 x 71.6 x 7.80 мм', 'Вага': '171 г', 'Колір': 'чорний', 'Особливості корпусу': 'водонепроникні', 'Виробник': 'Apple',
    #         'Модель': 'iPhone 15 128GB Black', 'Артикул': 'MTP03', 'Гарантія, міс': '12', 'Штрихкод': '195949036019', 'Примітка': 'Виробник може змінювати властивості, характеристики, зовнішній вигляд і комплектацію товарів без попередження', 'Всі характеристики': 'Приховати'}

    for key, value in dict_specs.items():
        added_specs = MainSpec.objects.get_or_create(name = key, property = value)

    return render(request, 'specs_bs4.html')

def specs_plw(request, **kwargs):  # value = None):
    ''' Dumps the parsed characteristics into PostGRE database '''



    print(40*"*")
    BASE_DIR = Path(__file__);print("Base Folder:",BASE_DIR.parent.parent)
    path = BASE_DIR.parent.parent/"json"
    path.mkdir(parents = True, exist_ok = True)
    file_path = path/ "res_data_plw.json"; print("READING FROM:", file_path)

    print("FILE PATH:", file_path)
    print("EXISTS:", file_path.exists())
    if not file_path.exists():
        main()  # creates the JSON file

    with open(file_path, 'r',encoding = "utf-8") as fik:

        phone_characteristics = json.load(fik)
        print(phone_characteristics, "\n", type(phone_characteristics))



    # phone_characteristics = {'Форм-фактор': 'моноблок', 'Кількість SIM-карт': '1 SIM + e-sim', 'Формат SIM-карти': 'e-sim , Nano', "Покоління зв'язку (2G /3G/4G/5G)": '2G , 3G , 4G , 5G', 'Тип дисплея': 'OLED', 'Діагональ екрану': '6.1"', 'Роздільна здатність екрану': '1179 х 2556', 'Частота оновлення екрану': '60 Гц',
    #         'Процесор': 'Apple A16 Bionic', 'Кількість ядер': '6 core', "Вбудована пам'ять": '128 Gb', 'Кількість модулів основної камери': '2', 'Основна камера': '48 + 12 Mpx', 'Діафрагма основної камери': 'f/1.6 + f/2.4', 'Метод стабілізації': 'оптична', 'Запис відео основної камери': '4K / 3840x2160 / стереозвук',
    #         'Кількість модулів фронтальної камери': '1', 'Фронтальна камера': '12 Mpx', 'Діафрагма фронтальної камери': 'f/1.9', 'Функції камери': 'панорама , розпізнавання обличчя , геотегінг , спалах , автофокус', 'Операційна система': 'iOS 17', 'Мультимедіа': 'FM-радіо , мобільні сервіси Google , соціальні мережі , відеоплеєр , музичний плеєр , ігри',
    #         'Органайзер': 'калькулятор , телефонна книга , диктофон , секундомір , нотатки , будильник , світовий час , годинник , календар', 'Бездротові підключення': 'Bluetooth , WI-FI , NFC', 'Навігація': 'BeiDou , Galileo , QZSS , iBeacon , GPS , A-GPS', 'Інтерфейси і підключення': 'USB Type-C', 'Особливості': 'IP68 certified',
    #         'Вбудовані датчики': 'датчик освітлення , компас , акселерометр , датчик наближення , гіроскоп , барометр', 'Безпека': 'FaceID', 'Оснащення': 'пило/вологозахист , гіроскоп , бездротове заряджання', 'Розміри (мм)': '147.6 x 71.6 x 7.80 мм', 'Вага': '171 г', 'Колір': 'чорний', 'Особливості корпусу': 'водонепроникні', 'Виробник': 'Apple',
    #         'Модель': 'iPhone 15 128GB Black', 'Артикул': 'MTP03', 'Гарантія, міс': '12', 'Штрихкод': '195949036019', 'Примітка': 'Виробник може змінювати властивості, характеристики, зовнішній вигляд і комплектацію товарів без попередження', 'Всі характеристики': 'Приховати'}

    for key, value in phone_characteristics.items():
        added_specs = MainSpec.objects.get_or_create(name = key, property = value)

    return render(request, 'specs_plw.html')

def specs_sel(request, **kwargs):  # value = None):
    ''' Dumps the parsed characteristics into PostGRE database '''


    # dict_specs = {'Форм-фактор': 'моноблок', 'Кількість SIM-карт': '1 SIM + e-sim', 'Формат SIM-карти': 'e-sim , Nano', "Покоління зв'язку (2G /3G/4G/5G)": '2G , 3G , 4G , 5G', 'Тип дисплея': 'OLED', 'Діагональ екрану': '6.1"', 'Роздільна здатність екрану': '1179 х 2556', 'Частота оновлення екрану': '60 Гц',
    #         'Процесор': 'Apple A16 Bionic', 'Кількість ядер': '6 core', "Вбудована пам'ять": '128 Gb', 'Кількість модулів основної камери': '2', 'Основна камера': '48 + 12 Mpx', 'Діафрагма основної камери': 'f/1.6 + f/2.4', 'Метод стабілізації': 'оптична', 'Запис відео основної камери': '4K / 3840x2160 / стереозвук',
    #         'Кількість модулів фронтальної камери': '1', 'Фронтальна камера': '12 Mpx', 'Діафрагма фронтальної камери': 'f/1.9', 'Функції камери': 'панорама , розпізнавання обличчя , геотегінг , спалах , автофокус', 'Операційна система': 'iOS 17', 'Мультимедіа': 'FM-радіо , мобільні сервіси Google , соціальні мережі , відеоплеєр , музичний плеєр , ігри',
    #         'Органайзер': 'калькулятор , телефонна книга , диктофон , секундомір , нотатки , будильник , світовий час , годинник , календар', 'Бездротові підключення': 'Bluetooth , WI-FI , NFC', 'Навігація': 'BeiDou , Galileo , QZSS , iBeacon , GPS , A-GPS', 'Інтерфейси і підключення': 'USB Type-C', 'Особливості': 'IP68 certified',
    #         'Вбудовані датчики': 'датчик освітлення , компас , акселерометр , датчик наближення , гіроскоп , барометр', 'Безпека': 'FaceID', 'Оснащення': 'пило/вологозахист , гіроскоп , бездротове заряджання', 'Розміри (мм)': '147.6 x 71.6 x 7.80 мм', 'Вага': '171 г', 'Колір': 'чорний', 'Особливості корпусу': 'водонепроникні', 'Виробник': 'Apple',
    #         'Модель': 'iPhone 15 128GB Black', 'Артикул': 'MTP03', 'Гарантія, міс': '12', 'Штрихкод': '195949036019', 'Примітка': 'Виробник може змінювати властивості, характеристики, зовнішній вигляд і комплектацію товарів без попередження', 'Всі характеристики': 'Приховати'}

    for key, value in phone_characteristics.items():
        added_specs = MainSpec.objects.get_or_create(name = key, property = value)

    return render(request, 'specs_sel.html')